backend: tensorflow
class_name: Sequential
config:
  layers:
  - class_name: Embedding
    config:
      activity_regularizer: null
      batch_input_shape: !!python/tuple
      - null
      - 48
      dtype: float32
      embeddings_constraint: null
      embeddings_initializer:
        class_name: RandomUniform
        config:
          maxval: 0.05
          minval: -0.05
          seed: null
      embeddings_regularizer: null
      input_dim: 5000
      input_length: 48
      mask_zero: false
      name: embedding_1
      output_dim: 128
      trainable: true
  - class_name: SpatialDropout1D
    config:
      dtype: float32
      name: spatial_dropout1d_2
      noise_shape: null
      rate: 0.4
      seed: null
      trainable: true
  - class_name: CuDNNLSTM
    config:
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      go_backwards: false
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: cu_dnnlstm
      recurrent_constraint: null
      recurrent_initializer:
        class_name: Orthogonal
        config:
          gain: 1.0
          seed: null
      recurrent_regularizer: null
      return_sequences: true
      return_state: false
      stateful: false
      time_major: false
      trainable: true
      unit_forget_bias: true
      units: 196
  - class_name: SpatialDropout1D
    config:
      dtype: float32
      name: spatial_dropout1d_3
      noise_shape: null
      rate: 0.4
      seed: null
      trainable: true
  - class_name: CuDNNLSTM
    config:
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      go_backwards: false
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: cu_dnnlstm_1
      recurrent_constraint: null
      recurrent_initializer:
        class_name: Orthogonal
        config:
          gain: 1.0
          seed: null
      recurrent_regularizer: null
      return_sequences: false
      return_state: false
      stateful: false
      time_major: false
      trainable: true
      unit_forget_bias: true
      units: 196
  - class_name: Dense
    config:
      activation: softmax
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 2
      use_bias: true
  name: sequential_1
keras_version: 2.2.4-tf
